## Модуль оплаты HTML и JavaScript

### Пример формы

* HostedCheckout.html - пример формы с inline css стилями и данными покупателя

### Установка
* Откройте в редакторе страницу на которую требуется вставить форму
* Скопируйте код между тегами <body></body>, включая теги <style> и <script>
* Вставьте к себе на страницу оплаты
* Задайте настройки скрипта

### Настройки скрипта
Для корректной работы необходимо указать следующие переменные:
* Обязательные переменные: 
  * AssetPaymentsKey - ID продавца
  * paymentSystem - ID поцессинга
  * orderId - номер заказа в магазине
  * returnUrl - URL страницы на которую будет перенаправлен покупатель после оплаты 
  * email - Email покупателя для отправки квитанции об оплате
  * amount - Сумма платежа в формате (0.00)
  * currency - валюта платежа в формате ISO-3 (например USD)

* Опциональные переменные: 
  * statusUrl - URL страницы на которую будет отправлен callback с результатом оплаты 
  * firstName - имя покупателя
  * secondName - фамилия покупателя
  * phone - номер телефона покупателя
  * address - адрес доставки (улица, номер)
  * city - город доставки
  * zone - область
  * country - страна
  * zip - индекс
  * convertText - перевести все введенные данные в латиницу
